examples/delta-wing-5p3o-hpc/input/case_template/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         40.0;

deltaT          0.05;

writeControl    timeStep;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

allowSystemOperations 1;

functions
{
    forceCoeffs1
    {
        type            forceCoeffs;

        libs            (forces);

        writeControl    timeStep;
        writeInterval   1;

        log             yes;

        patches         (solid);
        rho             rhoInf;
        rhoInf          1.225;
        liftDir         (0 0 1);
        dragDir         (1 0 0);
        CofR            (0.4411 0 0);  // GEOMETRY DEPENDANT - CHANGE ME
        pitchAxis       (0 1 0);
        magUInf         10;
        lRef            0.6118;        // GEOMETRY DEPENDANT - CHANGE ME
        Aref            0.5594;        // GEOMETRY DEPENDANT - CHANGE ME
    }
    
    yPlus
    {
        type            yPlus;
        libs            ("libfieldFunctionObjects.so");
        writeControl    timeStep;   
    }

    wallShearStress1
    {
        type            wallShearStress;
        libs            (fieldFunctionObjects);
        patches         (solid); 
        writeToFile     true;
    }

    forces
    {
        type        forces;
        libs        ("libforces.so");
        patches     (solid);          
        p           p;
        U           U;
        rho         rhoInf;           
        rhoInf      1.225;             
        pRef        0;            
        CofR        (0.4411 0 0);           // GEOMETRY DEPENDANT - CHANGE ME
        writeFields     yes;
    }
    binField1
    {
        type                    binField;
        libs                    (fieldFunctionObjects);
        binModel                singleDirectionUniformBin;
        fields                  (force);
        patches                 (solid);
        decomposePatchValues    yes;
        CofR                    (0.4411 0 0);  // GEOMETRY DEPENDANT - CHANGE ME

        binData
        {
            nBin        30;          // output data into n bins
            direction   (1 0 0);     // bin direction
            cumulative  yes;
        }
        writeControl            writeTime;
    }

}

OptimisationSwitches
{
    fileHandler collated;
}

// ************************************************************************* //
